{
  "projects": [
    {
      "title": "First Porfolio",
      "tecnologics": ["JS", "CSS", "HTML"],
      "description": "Portafolio web personal desarrollado con HTML, CSS y JavaScript, centrado en diseño responsivo, dinamismo, accesibilidad y presentación profesional. Integra EmailJS para envío de mensajes sin backend. Incluye proyectos destacados, habilidades técnicas, enlaces a redes sociales, CV descargable, datos de contacto actualizados y navegación clara.",
      "urlGit": "https://github.com/RolDev-22/portafolio_Dev",
      "urlPage": "https://portafolio-dev-iota.vercel.app/"
    },
    {
      "title": "Portfolio Profesional v2",
      "tecnologics": ["JS", "CSS", "HTML", "React"],
      "description": "Desarrollo de interfaz de usuario de alta fidelidad utilizando el ecosistema de React. El proyecto se centra en la optimización del lado del cliente, utilizando estructuras de datos estáticas para un renderizado veloz y EmailJS para garantizar una comunicación eficiente. Se priorizó la semántica de HTML5 y las capacidades modernas de CSS",
      "urlGit": "https://github.com/RolDev-22/portfolio_",
      "urlPage": "https://portfolio-rj5c.vercel.app/"
    },
    {
      "title": "Page Taller",
      "tecnologics": ["React", "CSS3", "HTML5"],
      "description": "Aplicación web desarrollada con React + Vite, empleando HTML5 y CSS3 para la construcción de la interfaz., ofreciendo una solución moderna, ligera y escalable. En la misma se integra el uso de mapas interactivos con Leaflet, permitiendo a los usuarios visualizar ubicaciones de talleres de manera dinámica. El proyecto se enfoca en la experiencia del usuario",
      "urlGit": "https://github.com/RolDev-22/page-taller",
      "urlPage": "https://page-taller.vercel.app/"
    },
    {
      "title": "To Do List App",
      "tecnologics": ["React", "CSS3", "HTML5"],
      "description": "Aplicación de lista de tareas desarrollada con React para practicar el manejo de estados y eventos. Se implementan componentes funcionales, hooks como useState y useEffect, y lógica en JavaScript puro para operaciones básicas. El proyecto permite agregar, eliminar y marcar tareas, con enfoque en modularidad y buenas prácticas.",
      "urlGit": "https://github.com/RolDev-22/to-do-react",
      "urlPage": "https://roldev-22.github.io/to-do-react/"
    },
    {
      "title": "Calculator App",
      "tecnologics": ["JS", "CSS", "HTML"],
      "description": "Este proyecto consiste en una calculadora funcional desarrollada con JavaScript puro, orientada a fortalecer habilidades iniciales en desarrollo web. La aplicación implementa: Captura dinámica de datos del usuario mediante eventos del navegador (click, input), sin frameworks externos. Manipulación directa del DOM para actualizar la interfaz",
      "urlGit": "https://github.com/RolDev-22/Calculadora_JS",
      "urlPage": "https://roldev-22.github.io/Calculadora_JS/"
    }
  ]
}
